#!/usr/bin/env python
# -*- coding: UTF-8 -*-

"""
任务一：随机给四个玩家发牌（52张牌）， 并打印出来

完成这个任务用到了random模块导入与使用，变量，字符串、整形、浮点型、元组等数据类型，数据类型的转换，运算符，表达式，字符串的操作，if流程语句等相关知识。
"""

import random

card_list = [
    ('红桃', 'A'),
    ('红桃', '2'),
    ('红桃', '3'),
    ('红桃', '4'),
    ('红桃', '5'),
    ('红桃', '6'),
    ('红桃', '7'),
    ('红桃', '8'),
    ('红桃', '9'),
    ('红桃', '10'),
    ('红桃', 'J'),
    ('红桃', 'Q'),
    ('红桃', 'K'),
    ('方块', 'A'),
    ('方块', '2'),
    ('方块', '3'),
    ('方块', '4'),
    ('方块', '5'),
    ('方块', '6'),
    ('方块', '7'),
    ('方块', '8'),
    ('方块', '9'),
    ('方块', '10'),
    ('方块', 'J'),
    ('方块', 'Q'),
    ('方块', 'K'),
    ('黑桃', 'A'),
    ('黑桃', '2'),
    ('黑桃', '3'),
    ('黑桃', '4'),
    ('黑桃', '5'),
    ('黑桃', '6'),
    ('黑桃', '7'),
    ('黑桃', '8'),
    ('黑桃', '9'),
    ('黑桃', '10'),
    ('黑桃', 'J'),
    ('黑桃', 'Q'),
    ('黑桃', 'K'),
    ('梅花', 'A'),
    ('梅花', '2'),
    ('梅花', '3'),
    ('梅花', '4'),
    ('梅花', '5'),
    ('梅花', '6'),
    ('梅花', '7'),
    ('梅花', '8'),
    ('梅花', '9'),
    ('梅花', '10'),
    ('梅花', 'J'),
    ('梅花', 'Q'),
    ('梅花', 'K')
]

card_rand = random.sample(card_list, 52)

player1 = card_rand[0:12]
player2 = card_rand[13:25]
player3 = card_rand[26:38]
player4 = card_rand[39:51]

print('玩家一的牌：')
print(player1)
print('玩家二的牌：')
print(player2)
print('玩家三的牌：')
print(player3)
print('玩家四的牌：')
print(player4)
