#!/usr/bin/env python
# -*- coding: UTF-8 -*-

"""
任务二：随机从52张牌中发两张牌给庄家，计算庄家两张牌的大小

要求：

    1. 在任务一的基础上编写代码

    2. 随机产生52张牌中的两张并打印出来

    3. 计算两张牌的总点数（J,Q,K代表0.5点，A是1点，其它则就是数字大小）

    4. 打印出两张牌的总点数


完成这个任务用到了random模块导入与使用，变量，字符串、整形、浮点型、元组等数据类型，数据类型的转换，运算符，表达式，字符串的操作，if流程语句等相关知识。
"""

import random

card_list = [
    ('红桃', 'A'),
    ('红桃', '2'),
    ('红桃', '3'),
    ('红桃', '4'),
    ('红桃', '5'),
    ('红桃', '6'),
    ('红桃', '7'),
    ('红桃', '8'),
    ('红桃', '9'),
    ('红桃', '10'),
    ('红桃', 'J'),
    ('红桃', 'Q'),
    ('红桃', 'K'),
    ('方块', 'A'),
    ('方块', '2'),
    ('方块', '3'),
    ('方块', '4'),
    ('方块', '5'),
    ('方块', '6'),
    ('方块', '7'),
    ('方块', '8'),
    ('方块', '9'),
    ('方块', '10'),
    ('方块', 'J'),
    ('方块', 'Q'),
    ('方块', 'K'),
    ('黑桃', 'A'),
    ('黑桃', '2'),
    ('黑桃', '3'),
    ('黑桃', '4'),
    ('黑桃', '5'),
    ('黑桃', '6'),
    ('黑桃', '7'),
    ('黑桃', '8'),
    ('黑桃', '9'),
    ('黑桃', '10'),
    ('黑桃', 'J'),
    ('黑桃', 'Q'),
    ('黑桃', 'K'),
    ('梅花', 'A'),
    ('梅花', '2'),
    ('梅花', '3'),
    ('梅花', '4'),
    ('梅花', '5'),
    ('梅花', '6'),
    ('梅花', '7'),
    ('梅花', '8'),
    ('梅花', '9'),
    ('梅花', '10'),
    ('梅花', 'J'),
    ('梅花', 'Q'),
    ('梅花', 'K')
]


def calculate(card_list):
    sum = 0
    for card in card_list:
        # print(card)
        # print('+++++++++++++++++++++++++++++++++')
        # print(card[1])
        # print('+++++++++++++++++++++++++++++++++')
        card_number = transfer(card[1])
        sum += card_number
    return sum


def transfer(poke):
    print('+++++++++++++++++++++++++++++++++')
    print(poke)
    print('+++++++++++++++++++++++++++++++++')
    if poke == 'A':
        return 1
    elif poke == 'J':
        return 0.5
    elif poke == 'Q':
        return 0.5
    elif poke == 'K':
        return 0.5
    else:
        return int(poke)


card_rand = random.sample(card_list, 52)

player1 = card_rand[0:2]
print("庄家手上的牌: ")
print(player1)

print("======= 两张牌的总点数 =======")
sum = calculate(player1)
print(sum)
print("============================")
