#!/usr/bin/env python
# -*- coding: UTF-8 -*-

"""

任务三：模拟第一轮发牌并打印出来

  1.创建4个玩家（1个庄家，3个闲家），具体包含姓名、筹码、要牌标识符、牌列表、牌点数、下注数等信息。

    （默认要牌标识符为True；筹码数为100）

  2.实现3个闲家下注，规定每次下注不超过20个筹码

  3.模拟产生一副除去大小王的扑克牌，并洗牌

  4.实现第一轮发牌，并打印出4个玩家的牌信息


"""

import random

card_list = [
    ('红桃', 'A'),
    ('红桃', '2'),
    ('红桃', '3'),
    ('红桃', '4'),
    ('红桃', '5'),
    ('红桃', '6'),
    ('红桃', '7'),
    ('红桃', '8'),
    ('红桃', '9'),
    ('红桃', '10'),
    ('红桃', 'J'),
    ('红桃', 'Q'),
    ('红桃', 'K'),
    ('方块', 'A'),
    ('方块', '2'),
    ('方块', '3'),
    ('方块', '4'),
    ('方块', '5'),
    ('方块', '6'),
    ('方块', '7'),
    ('方块', '8'),
    ('方块', '9'),
    ('方块', '10'),
    ('方块', 'J'),
    ('方块', 'Q'),
    ('方块', 'K'),
    ('黑桃', 'A'),
    ('黑桃', '2'),
    ('黑桃', '3'),
    ('黑桃', '4'),
    ('黑桃', '5'),
    ('黑桃', '6'),
    ('黑桃', '7'),
    ('黑桃', '8'),
    ('黑桃', '9'),
    ('黑桃', '10'),
    ('黑桃', 'J'),
    ('黑桃', 'Q'),
    ('黑桃', 'K'),
    ('梅花', 'A'),
    ('梅花', '2'),
    ('梅花', '3'),
    ('梅花', '4'),
    ('梅花', '5'),
    ('梅花', '6'),
    ('梅花', '7'),
    ('梅花', '8'),
    ('梅花', '9'),
    ('梅花', '10'),
    ('梅花', 'J'),
    ('梅花', 'Q'),
    ('梅花', 'K')
]
